# db.py

patients_db = {
    "남A": {
        "이름": "김영수",
        "성별": "남자",
        "나이": 77,
        "입원일": "2024-02-15",
        "병실번호": "101",
        "병실정보": "2인실",
        "담당의사": "이민수",
        "질환명": ["고혈압", "당뇨", "뇌출혈", "편마비"],
        "image_path": "male_A.png"  # 남A의 이미지 경로
    },
    "남B": {
        "이름": "박정희",
        "성별": "남자",
        "나이": 82,
        "입원일": "2024-04-23",
        "병실번호": "102",
        "병실정보": "1인실",
        "담당의사": "김영호",
        "질환명": ["전립선암", "뇌경색", "고혈압", "편마비"],
        "image_path": "male_B.png"  # 남B의 이미지 경로
    },
    "남C": {
        "이름": "이순남",
        "성별": "남자",
        "나이": 58,
        "입원일": "2024-06-11",
        "병실번호": "103",
        "병실정보": "4인실",
        "담당의사": "이민수",
        "질환명": ["뇌전증", "고혈압", "당뇨", "뇌출혈"],
        "image_path": "male_C.png"  # 남C의 이미지 경로
    },
    "여A": {
        "이름": "최말순",
        "성별": "여자",
        "나이": 88,
        "입원일": "2024-01-30",
        "병실번호": "104",
        "병실정보": "2인실",
        "담당의사": "김영호",
        "질환명": ["천식", "고혈압", "관절염", "위염"],
        "image_path": "female_A.png"  # 여A의 이미지 경로
    },
    "여B": {
        "이름": "한정자",
        "성별": "여자",
        "나이": 77,
        "입원일": "2024-07-19",
        "병실번호": "105",
        "병실정보": "1인실",
        "담당의사": "이민수",
        "질환명": ["치매", "뇌경색", "고지혈증", "신장염"],
        "image_path": "female_B.png"  # 여B의 이미지 경로
    },
    "여C": {
        "이름": "유복자",
        "성별": "여자",
        "나이": 91,
        "입원일": "2024-08-08",
        "병실번호": "106",
        "병실정보": "4인실",
        "담당의사": "김영호",
        "질환명": ["치매", "고혈압", "당뇨", "폐혈증"],
        "image_path": "female_C.png"  # 여C의 이미지 경로
    }
}